10_Pagination_Searching/app/Controllers/Orang.php

    public function index()
    {

        $currentPage = $this->request->getVar('page_orang') ? $this->request->getVar('page_orang') : 1;

        $data = [
            'judul' => 'Daftar Orang',
            // 'orang' => $this->orangModel->findAll()
            'orang' => $this->orangModel->paginate(5, 'orang'),      // tiap halaman ingin berapa data
---
SELECT *
FROM `orang`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `orang`