04_Model/app/Controllers/Komik.php

SELECT *
FROM `komik`
---
    public function index()
    {
        $komik = $this->komikModel->findAll();